using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace NORMAPP
{
    public partial class Form3 : Form
    {
        public Form3(int StateF, string a, string TypeEvent, string DescEvent, string user, string a1, string a2, string a3, string a4, string a5, string a6, string a7, float f1, float f2, float f3, float f4, float f5, int i1, int i2, int i3, string ConS)
        {
            InitializeComponent();
            this.StateF = StateF;
            this.a = a;
            this.TypeEvent = TypeEvent;
            this.DescEvent = DescEvent;
            this.user = user;
            this.a1 = a1;
            this.a2 = a2;
            this.a3 = a3;
            this.a4 = a4;
            this.a5 = a5;
            this.a6 = a6;
            this.a7 = a7;
            this.f1 = f1;
            this.f2 = f2;
            this.f3 = f3;
            this.f4 = f4;
            this.f5 = f5;
            this.i1 = i1;
            this.i2 = i2;
            this.i3 = i3;
            this.ConS = ConS;
        }
        public int StateF;
        public string a;
        public string TypeEvent;
        public string DescEvent;
        public string user;
        public string a1;
        public string a2;
        public string a3;
        public string a4;
        public string a5;
        public string a6;
        public string a7;
        public float f1;
        public float f2;
        public float f3;
        public float f4;
        public float f5;
        public int i1;
        public int i2;
        public int i3;
        public string ConS;

        private void Form3_Load(object sender, EventArgs e)
        {
            this.ActiveControl = button1;
            this.Text = "Добавление в БД";
            button3.Visible = true;
            button1.TabIndex = 0;

            //Закачик Заказ Перечень
            if (StateF == 29)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                comboBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                button2.TabIndex = 5;
                textBox1.Visible = true;
                textBox2.Visible = true;
                comboBox3.Visible = true;
                textBox4.Visible = true;
                textBox1.Text = "Введите Код Заказчика";
                textBox2.Text = "Введите Имя Заказчика";
                comboBox3.Text = "Выберите Тип Заказчика";
                comboBox3.Items.AddRange(new string[]{ "Юрлицо", "Физлицо", "Другое" });
                textBox4.Text = "Введите Описание/Пометки Заказчика";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Заказчик";
            }
            if (StateF == 30)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                comboBox5.TabIndex = 5;
                textBox6.TabIndex = 6;
                button2.TabIndex = 7;    
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                comboBox5.Visible = true;
                textBox6.Visible = true;
                textBox1.Text = "Введите Код Заказчика БД для связи";
                textBox2.Text = "Введите Код Заказа";
                textBox3.Text = "Введите Имя Заказа";
                textBox4.Text = DateTime.Now.ToShortDateString();
                comboBox5.Text = "Выберите Тип Заказа";
                comboBox5.Items.AddRange(new string[]
                {
                    "Изготовление",
                    "Ремонт/ТО",
                    "Прочее"
                });
                textBox6.Text = "Введите Описание/Пометки Заказа";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Заказ";
            }
            if (StateF == 31)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                button2.TabIndex = 5;
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                textBox1.Text = "Введите Код Заказа БД для Связи";
                textBox2.Text = "Введите Имя Строки Перечня";
                textBox3.Text = "Введите Кол-во штук";
                textBox4.Text = "Введите Описание/Пометки Строки Перечня";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Перечень Заказа";
            }
            //Изделие Узел Деталь
            if (StateF == 46)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                comboBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                textBox5.TabIndex = 5;
                textBox6.TabIndex = 6;
                textBox7.TabIndex = 7;
                textBox8.TabIndex = 8;
                textBox9.TabIndex = 9;
                textBox1.Visible = true;
                textBox2.Visible = true;
                comboBox3.Visible = true;
                textBox4.Visible = true;
                textBox5.Visible = true;
                textBox6.Visible = true;
                textBox7.Visible = true;
                textBox8.Visible = true;
                textBox9.Visible = true;
                textBox1.Text = "Введите Код Изделия";
                textBox2.Text = "Введите Имя Изделия";
                comboBox3.Text = "Выберите Тип Изделия";
                comboBox3.Items.AddRange(new string[]
                {
                    "Изделие",
                    "Узел",
                    "Деталь",
                    "Стандартное Изделие",
                    "Другое"
                });
                textBox4.Text = "Введите ГОСТ Изделия";
                textBox5.Text = "Введите Массу кг.(123,321)";
                textBox6.Text = "Введите Длинну мм.(123,321)";
                textBox7.Text = "Введите Ширину мм.(123,321)";
                textBox8.Text = "Введите Высоту мм.(123,321)";
                textBox9.Text = "Введите Описание/Пометки Изделия";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Изделия";
            }
            if (StateF == 47)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                comboBox5.TabIndex = 5;
                textBox6.TabIndex = 6;
                comboBox7.TabIndex = 7;
                textBox8.TabIndex = 8;
                textBox9.TabIndex = 9;
                textBox10.TabIndex = 10;
                textBox11.TabIndex = 11;
                textBox12.TabIndex = 12;
                textBox13.TabIndex = 13;
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                comboBox5.Visible = true;
                textBox6.Visible = true;
                comboBox7.Visible = true;
                textBox8.Visible = true;
                textBox9.Visible = true;
                textBox10.Visible = true;
                textBox11.Visible = true;
                textBox12.Visible = true;
                textBox13.Visible = true;
                textBox1.Text = "Введите Код Узла/Детали";
                textBox2.Text = "Введите № Вложенности Узла/Детали (1.2.3.4.5.6)";
                textBox3.Text = "Ведите Порядковый № Узла/Детали (24)";
                textBox4.Text = "Введите Имя Узла/Детали";
                comboBox5.Text = "Выберите Тип Узла/Детали";
                comboBox5.Items.AddRange(new string[]
                {
                    "Узел",
                    "Деталь",
                    "Стандартное Изделие",
                    "Другое"
                });
                textBox6.Text = "Введите ГОСТ Узла/Детали";
                comboBox7.Text = "Выберите Тип действия над Узлом/Деталью";
                comboBox7.Items.AddRange(new string[]
                    {
                        "Купить",
                        "Изготовить",
                        "Ремонт",
                        "Другое"
                    });
                textBox8.Text = "Введите Количество шт. (3)";
                textBox9.Text = "Введите Массу кг.(123,321)";
                textBox10.Text = "Введите Длинну мм.(123,321)";
                textBox11.Text = "Введите Ширину мм.(123,321)";
                textBox12.Text = "Введите Высоту мм.(123,321)";
                textBox13.Text = "Введите Описание/Пометки Узла/Детали";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Узлы/Детали";
            }
            //Добавление Материалов Норм ГОСТ
            if (StateF == 65)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                comboBox5.TabIndex = 5;
                textBox6.TabIndex = 6;
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                comboBox5.Visible = true;
                textBox6.Visible = true;
                textBox1.Text = "Введите Код Материала";
                textBox2.Text = "Введите Имя Материала";
                textBox3.Text = "Введите ГОСТ Материала";
                textBox4.Text = "Введите Марку Материала";
                comboBox5.Text = "Выберите Тип Материала";
                comboBox5.Items.AddRange(new string[]
                {
                   "Металлы",
                    "Метизы",
                    "Подшипники",
                    "РезТехИзд",
                    "ЭлектроОбор",
                    "Литье/ковка",
                    "Сварка",
                    "ГСМ",
                    "Лакокрасочные",
                    "ДревСтружМат",
                    "Сборочная",
                    "Прочее"
            });
                textBox6.Text = "Введите Описание Материала";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Материал";
            }
            if (StateF == 66)
            {
                comboBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                textBox5.TabIndex = 5;
                comboBox6.TabIndex = 6;
                textBox7.TabIndex = 7;
                comboBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                textBox5.Visible = true;
                comboBox6.Visible = true;
                textBox7.Visible = true;
                comboBox1.Text = "Выберите Тип Нормы";
                comboBox1.Items.AddRange(new string[]
                {
                   "Изготовительная",
                    "Ремонтная",
                    "Прочее"
            });
                textBox2.Text = "Введите ГОСТ Нормы";
                textBox3.Text = "Введите Кол-во 1 (15,654)";
                textBox4.Text = "Введите Кол-во 2 (15,654)";
                textBox5.Text = "Введите Кол-во 3 (15,654)";
                comboBox6.Text = "Выберите Единицы Измерения Нормы";
                comboBox6.Items.AddRange(new string[]
                {
                    "шт/шт/баллон",
                    "шт/шт/банка",
                    "шт/шт/бочка",
                    "шт/шт/бутылка",
                    "шт/шт/комплект",
                    "шт/шт/коробка",
                    "шт/шт/поддон",
                    "шт/шт/рулон",
                    "шт/шт/упаковка",
                    "шт/шт/ящик",
                    "шт/звено/баллон",
                    "шт/звено/банка",
                    "шт/звено/бочка",
                    "шт/звено/бутылка",
                    "шт/звено/комплект",
                    "шт/звено/коробка",
                    "шт/звено/поддон",
                    "шт/звено/рулон",
                    "шт/звено/упаковка",
                    "шт/звено/ящик",
                    "шт/кг/баллон",
                    "шт/кг/банка",
                    "шт/кг/бочка",
                    "шт/кг/бутылка",
                    "шт/кг/комплект",
                    "шт/кг/коробка",
                    "шт/кг/поддон",
                    "шт/кг/рулон",
                    "шт/кг/упаковка",
                    "шт/кг/ящик",
                    "шт/м.п./баллон",
                    "шт/м.п./банка",
                    "шт/м.п./бочка",
                    "шт/м.п./бутылка",
                    "шт/м.п./комплект",
                    "шт/м.п./коробка",
                    "шт/м.п./поддон",
                    "шт/м.п./рулон",
                    "шт/м.п./упаковка",
                    "шт/м.п./ящик",
                    "шт/м/баллон",
                    "шт/м/банка",
                    "шт/м/бочка",
                    "шт/м/бутылка",
                    "шт/м/комплект",
                    "шт/м/коробка",
                    "шт/м/поддон",
                    "шт/м/рулон",
                    "шт/м/упаковка",
                    "шт/м/ящик",
                    "шт/м2/баллон",
                    "шт/м2/банка",
                    "шт/м2/бочка",
                    "шт/м2/бутылка",
                    "шт/м2/комплект",
                    "шт/м2/коробка",
                    "шт/м2/поддон",
                    "шт/м2/рулон",
                    "шт/м2/упаковка",
                    "шт/м2/ящик",
                    "шт/м3/баллон",
                    "шт/м3/банка",
                    "шт/м3/бочка",
                    "шт/м3/бутылка",
                    "шт/м3/комплект",
                    "шт/м3/коробка",
                    "шт/м3/поддон",
                    "шт/м3/рулон",
                    "шт/м3/упаковка",
                    "шт/м3/ящик",
                    "шт/л/баллон",
                    "шт/л/банка",
                    "шт/л/бочка",
                    "шт/л/бутылка",
                    "шт/л/комплект",
                    "шт/л/коробка",
                    "шт/л/поддон",
                    "шт/л/рулон",
                    "шт/л/упаковка",
                    "шт/л/ящик",
                    "звено/шт/баллон",
                    "звено/шт/банка",
                    "звено/шт/бочка",
                    "звено/шт/бутылка",
                    "звено/шт/комплект",
                    "звено/шт/коробка",
                    "звено/шт/поддон",
                    "звено/шт/рулон",
                    "звено/шт/упаковка",
                    "звено/шт/ящик",
                    "звено/звено/баллон",
                    "звено/звено/банка",
                    "звено/звено/бочка",
                    "звено/звено/бутылка",
                    "звено/звено/комплект",
                    "звено/звено/коробка",
                    "звено/звено/поддон",
                    "звено/звено/рулон",
                    "звено/звено/упаковка",
                    "звено/звено/ящик",
                    "звено/кг/баллон",
                    "звено/кг/банка",
                    "звено/кг/бочка",
                    "звено/кг/бутылка",
                    "звено/кг/комплект",
                    "звено/кг/коробка",
                    "звено/кг/поддон",
                    "звено/кг/рулон",
                    "звено/кг/упаковка",
                    "звено/кг/ящик",
                    "звено/м.п./баллон",
                    "звено/м.п./банка",
                    "звено/м.п./бочка",
                    "звено/м.п./бутылка",
                    "звено/м.п./комплект",
                    "звено/м.п./коробка",
                    "звено/м.п./поддон",
                    "звено/м.п./рулон",
                    "звено/м.п./упаковка",
                    "звено/м.п./ящик",
                    "звено/м/баллон",
                    "звено/м/банка",
                    "звено/м/бочка",
                    "звено/м/бутылка",
                    "звено/м/комплект",
                    "звено/м/коробка",
                    "звено/м/поддон",
                    "звено/м/рулон",
                    "звено/м/упаковка",
                    "звено/м/ящик",
                    "звено/м2/баллон",
                    "звено/м2/банка",
                    "звено/м2/бочка",
                    "звено/м2/бутылка",
                    "звено/м2/комплект",
                    "звено/м2/коробка",
                    "звено/м2/поддон",
                    "звено/м2/рулон",
                    "звено/м2/упаковка",
                    "звено/м2/ящик",
                    "звено/м3/баллон",
                    "звено/м3/банка",
                    "звено/м3/бочка",
                    "звено/м3/бутылка",
                    "звено/м3/комплект",
                    "звено/м3/коробка",
                    "звено/м3/поддон",
                    "звено/м3/рулон",
                    "звено/м3/упаковка",
                    "звено/м3/ящик",
                    "звено/л/баллон",
                    "звено/л/банка",
                    "звено/л/бочка",
                    "звено/л/бутылка",
                    "звено/л/комплект",
                    "звено/л/коробка",
                    "звено/л/поддон",
                    "звено/л/рулон",
                    "звено/л/упаковка",
                    "звено/л/ящик",
                    "кг/шт/баллон",
                    "кг/шт/банка",
                    "кг/шт/бочка",
                    "кг/шт/бутылка",
                    "кг/шт/комплект",
                    "кг/шт/коробка",
                    "кг/шт/поддон",
                    "кг/шт/рулон",
                    "кг/шт/упаковка",
                    "кг/шт/ящик",
                    "кг/звено/баллон",
                    "кг/звено/банка",
                    "кг/звено/бочка",
                    "кг/звено/бутылка",
                    "кг/звено/комплект",
                    "кг/звено/коробка",
                    "кг/звено/поддон",
                    "кг/звено/рулон",
                    "кг/звено/упаковка",
                    "кг/звено/ящик",
                    "кг/кг/баллон",
                    "кг/кг/банка",
                    "кг/кг/бочка",
                    "кг/кг/бутылка",
                    "кг/кг/комплект",
                    "кг/кг/коробка",
                    "кг/кг/поддон",
                    "кг/кг/рулон",
                    "кг/кг/упаковка",
                    "кг/кг/ящик",
                    "кг/м.п./баллон",
                    "кг/м.п./банка",
                    "кг/м.п./бочка",
                    "кг/м.п./бутылка",
                    "кг/м.п./комплект",
                    "кг/м.п./коробка",
                    "кг/м.п./поддон",
                    "кг/м.п./рулон",
                    "кг/м.п./упаковка",
                    "кг/м.п./ящик",
                    "кг/м/баллон",
                    "кг/м/банка",
                    "кг/м/бочка",
                    "кг/м/бутылка",
                    "кг/м/комплект",
                    "кг/м/коробка",
                    "кг/м/поддон",
                    "кг/м/рулон",
                    "кг/м/упаковка",
                    "кг/м/ящик",
                    "кг/м2/баллон",
                    "кг/м2/банка",
                    "кг/м2/бочка",
                    "кг/м2/бутылка",
                    "кг/м2/комплект",
                    "кг/м2/коробка",
                    "кг/м2/поддон",
                    "кг/м2/рулон",
                    "кг/м2/упаковка",
                    "кг/м2/ящик",
                    "кг/м3/баллон",
                    "кг/м3/банка",
                    "кг/м3/бочка",
                    "кг/м3/бутылка",
                    "кг/м3/комплект",
                    "кг/м3/коробка",
                    "кг/м3/поддон",
                    "кг/м3/рулон",
                    "кг/м3/упаковка",
                    "кг/м3/ящик",
                    "кг/л/баллон",
                    "кг/л/банка",
                    "кг/л/бочка",
                    "кг/л/бутылка",
                    "кг/л/комплект",
                    "кг/л/коробка",
                    "кг/л/поддон",
                    "кг/л/рулон",
                    "кг/л/упаковка",
                    "кг/л/ящик",
                    "м.п./шт/баллон",
                    "м.п./шт/банка",
                    "м.п./шт/бочка",
                    "м.п./шт/бутылка",
                    "м.п./шт/комплект",
                    "м.п./шт/коробка",
                    "м.п./шт/поддон",
                    "м.п./шт/рулон",
                    "м.п./шт/упаковка",
                    "м.п./шт/ящик",
                    "м.п./звено/баллон",
                    "м.п./звено/банка",
                    "м.п./звено/бочка",
                    "м.п./звено/бутылка",
                    "м.п./звено/комплект",
                    "м.п./звено/коробка",
                    "м.п./звено/поддон",
                    "м.п./звено/рулон",
                    "м.п./звено/упаковка",
                    "м.п./звено/ящик",
                    "м.п./кг/баллон",
                    "м.п./кг/банка",
                    "м.п./кг/бочка",
                    "м.п./кг/бутылка",
                    "м.п./кг/комплект",
                    "м.п./кг/коробка",
                    "м.п./кг/поддон",
                    "м.п./кг/рулон",
                    "м.п./кг/упаковка",
                    "м.п./кг/ящик",
                    "м.п./м.п./баллон",
                    "м.п./м.п./банка",
                    "м.п./м.п./бочка",
                    "м.п./м.п./бутылка",
                    "м.п./м.п./комплект",
                    "м.п./м.п./коробка",
                    "м.п./м.п./поддон",
                    "м.п./м.п./рулон",
                    "м.п./м.п./упаковка",
                    "м.п./м.п./ящик",
                    "м.п./м/баллон",
                    "м.п./м/банка",
                    "м.п./м/бочка",
                    "м.п./м/бутылка",
                    "м.п./м/комплект",
                    "м.п./м/коробка",
                    "м.п./м/поддон",
                    "м.п./м/рулон",
                    "м.п./м/упаковка",
                    "м.п./м/ящик",
                    "м.п./м2/баллон",
                    "м.п./м2/банка",
                    "м.п./м2/бочка",
                    "м.п./м2/бутылка",
                    "м.п./м2/комплект",
                    "м.п./м2/коробка",
                    "м.п./м2/поддон",
                    "м.п./м2/рулон",
                    "м.п./м2/упаковка",
                    "м.п./м2/ящик",
                    "м.п./м3/баллон",
                    "м.п./м3/банка",
                    "м.п./м3/бочка",
                    "м.п./м3/бутылка",
                    "м.п./м3/комплект",
                    "м.п./м3/коробка",
                    "м.п./м3/поддон",
                    "м.п./м3/рулон",
                    "м.п./м3/упаковка",
                    "м.п./м3/ящик",
                    "м.п./л/баллон",
                    "м.п./л/банка",
                    "м.п./л/бочка",
                    "м.п./л/бутылка",
                    "м.п./л/комплект",
                    "м.п./л/коробка",
                    "м.п./л/поддон",
                    "м.п./л/рулон",
                    "м.п./л/упаковка",
                    "м.п./л/ящик",
                    "м/шт/баллон",
                    "м/шт/банка",
                    "м/шт/бочка",
                    "м/шт/бутылка",
                    "м/шт/комплект",
                    "м/шт/коробка",
                    "м/шт/поддон",
                    "м/шт/рулон",
                    "м/шт/упаковка",
                    "м/шт/ящик",
                    "м/звено/баллон",
                    "м/звено/банка",
                    "м/звено/бочка",
                    "м/звено/бутылка",
                    "м/звено/комплект",
                    "м/звено/коробка",
                    "м/звено/поддон",
                    "м/звено/рулон",
                    "м/звено/упаковка",
                    "м/звено/ящик",
                    "м/кг/баллон",
                    "м/кг/банка",
                    "м/кг/бочка",
                    "м/кг/бутылка",
                    "м/кг/комплект",
                    "м/кг/коробка",
                    "м/кг/поддон",
                    "м/кг/рулон",
                    "м/кг/упаковка",
                    "м/кг/ящик",
                    "м/м.п./баллон",
                    "м/м.п./банка",
                    "м/м.п./бочка",
                    "м/м.п./бутылка",
                    "м/м.п./комплект",
                    "м/м.п./коробка",
                    "м/м.п./поддон",
                    "м/м.п./рулон",
                    "м/м.п./упаковка",
                    "м/м.п./ящик",
                    "м/м/баллон",
                    "м/м/банка",
                    "м/м/бочка",
                    "м/м/бутылка",
                    "м/м/комплект",
                    "м/м/коробка",
                    "м/м/поддон",
                    "м/м/рулон",
                    "м/м/упаковка",
                    "м/м/ящик",
                    "м/м2/баллон",
                    "м/м2/банка",
                    "м/м2/бочка",
                    "м/м2/бутылка",
                    "м/м2/комплект",
                    "м/м2/коробка",
                    "м/м2/поддон",
                    "м/м2/рулон",
                    "м/м2/упаковка",
                    "м/м2/ящик",
                    "м/м3/баллон",
                    "м/м3/банка",
                    "м/м3/бочка",
                    "м/м3/бутылка",
                    "м/м3/комплект",
                    "м/м3/коробка",
                    "м/м3/поддон",
                    "м/м3/рулон",
                    "м/м3/упаковка",
                    "м/м3/ящик",
                    "м/л/баллон",
                    "м/л/банка",
                    "м/л/бочка",
                    "м/л/бутылка",
                    "м/л/комплект",
                    "м/л/коробка",
                    "м/л/поддон",
                    "м/л/рулон",
                    "м/л/упаковка",
                    "м/л/ящик",
                    "м2/шт/баллон",
                    "м2/шт/банка",
                    "м2/шт/бочка",
                    "м2/шт/бутылка",
                    "м2/шт/комплект",
                    "м2/шт/коробка",
                    "м2/шт/поддон",
                    "м2/шт/рулон",
                    "м2/шт/упаковка",
                    "м2/шт/ящик",
                    "м2/звено/баллон",
                    "м2/звено/банка",
                    "м2/звено/бочка",
                    "м2/звено/бутылка",
                    "м2/звено/комплект",
                    "м2/звено/коробка",
                    "м2/звено/поддон",
                    "м2/звено/рулон",
                    "м2/звено/упаковка",
                    "м2/звено/ящик",
                    "м2/кг/баллон",
                    "м2/кг/банка",
                    "м2/кг/бочка",
                    "м2/кг/бутылка",
                    "м2/кг/комплект",
                    "м2/кг/коробка",
                    "м2/кг/поддон",
                    "м2/кг/рулон",
                    "м2/кг/упаковка",
                    "м2/кг/ящик",
                    "м2/м.п./баллон",
                    "м2/м.п./банка",
                    "м2/м.п./бочка",
                    "м2/м.п./бутылка",
                    "м2/м.п./комплект",
                    "м2/м.п./коробка",
                    "м2/м.п./поддон",
                    "м2/м.п./рулон",
                    "м2/м.п./упаковка",
                    "м2/м.п./ящик",
                    "м2/м/баллон",
                    "м2/м/банка",
                    "м2/м/бочка",
                    "м2/м/бутылка",
                    "м2/м/комплект",
                    "м2/м/коробка",
                    "м2/м/поддон",
                    "м2/м/рулон",
                    "м2/м/упаковка",
                    "м2/м/ящик",
                    "м2/м2/баллон",
                    "м2/м2/банка",
                    "м2/м2/бочка",
                    "м2/м2/бутылка",
                    "м2/м2/комплект",
                    "м2/м2/коробка",
                    "м2/м2/поддон",
                    "м2/м2/рулон",
                    "м2/м2/упаковка",
                    "м2/м2/ящик",
                    "м2/м3/баллон",
                    "м2/м3/банка",
                    "м2/м3/бочка",
                    "м2/м3/бутылка",
                    "м2/м3/комплект",
                    "м2/м3/коробка",
                    "м2/м3/поддон",
                    "м2/м3/рулон",
                    "м2/м3/упаковка",
                    "м2/м3/ящик",
                    "м2/л/баллон",
                    "м2/л/банка",
                    "м2/л/бочка",
                    "м2/л/бутылка",
                    "м2/л/комплект",
                    "м2/л/коробка",
                    "м2/л/поддон",
                    "м2/л/рулон",
                    "м2/л/упаковка",
                    "м2/л/ящик",
                    "м3/шт/баллон",
                    "м3/шт/банка",
                    "м3/шт/бочка",
                    "м3/шт/бутылка",
                    "м3/шт/комплект",
                    "м3/шт/коробка",
                    "м3/шт/поддон",
                    "м3/шт/рулон",
                    "м3/шт/упаковка",
                    "м3/шт/ящик",
                    "м3/звено/баллон",
                    "м3/звено/банка",
                    "м3/звено/бочка",
                    "м3/звено/бутылка",
                    "м3/звено/комплект",
                    "м3/звено/коробка",
                    "м3/звено/поддон",
                    "м3/звено/рулон",
                    "м3/звено/упаковка",
                    "м3/звено/ящик",
                    "м3/кг/баллон",
                    "м3/кг/банка",
                    "м3/кг/бочка",
                    "м3/кг/бутылка",
                    "м3/кг/комплект",
                    "м3/кг/коробка",
                    "м3/кг/поддон",
                    "м3/кг/рулон",
                    "м3/кг/упаковка",
                    "м3/кг/ящик",
                    "м3/м.п./баллон",
                    "м3/м.п./банка",
                    "м3/м.п./бочка",
                    "м3/м.п./бутылка",
                    "м3/м.п./комплект",
                    "м3/м.п./коробка",
                    "м3/м.п./поддон",
                    "м3/м.п./рулон",
                    "м3/м.п./упаковка",
                    "м3/м.п./ящик",
                    "м3/м/баллон",
                    "м3/м/банка",
                    "м3/м/бочка",
                    "м3/м/бутылка",
                    "м3/м/комплект",
                    "м3/м/коробка",
                    "м3/м/поддон",
                    "м3/м/рулон",
                    "м3/м/упаковка",
                    "м3/м/ящик",
                    "м3/м2/баллон",
                    "м3/м2/банка",
                    "м3/м2/бочка",
                    "м3/м2/бутылка",
                    "м3/м2/комплект",
                    "м3/м2/коробка",
                    "м3/м2/поддон",
                    "м3/м2/рулон",
                    "м3/м2/упаковка",
                    "м3/м2/ящик",
                    "м3/м3/баллон",
                    "м3/м3/банка",
                    "м3/м3/бочка",
                    "м3/м3/бутылка",
                    "м3/м3/комплект",
                    "м3/м3/коробка",
                    "м3/м3/поддон",
                    "м3/м3/рулон",
                    "м3/м3/упаковка",
                    "м3/м3/ящик",
                    "м3/л/баллон",
                    "м3/л/банка",
                    "м3/л/бочка",
                    "м3/л/бутылка",
                    "м3/л/комплект",
                    "м3/л/коробка",
                    "м3/л/поддон",
                    "м3/л/рулон",
                    "м3/л/упаковка",
                    "м3/л/ящик",
                    "л/шт/баллон",
                    "л/шт/банка",
                    "л/шт/бочка",
                    "л/шт/бутылка",
                    "л/шт/комплект",
                    "л/шт/коробка",
                    "л/шт/поддон",
                    "л/шт/рулон",
                    "л/шт/упаковка",
                    "л/шт/ящик",
                    "л/звено/баллон",
                    "л/звено/банка",
                    "л/звено/бочка",
                    "л/звено/бутылка",
                    "л/звено/комплект",
                    "л/звено/коробка",
                    "л/звено/поддон",
                    "л/звено/рулон",
                    "л/звено/упаковка",
                    "л/звено/ящик",
                    "л/кг/баллон",
                    "л/кг/банка",
                    "л/кг/бочка",
                    "л/кг/бутылка",
                    "л/кг/комплект",
                    "л/кг/коробка",
                    "л/кг/поддон",
                    "/л/кг/рулон",
                    "л/кг/упаковка",
                    "л/кг/ящик",
                    "л/м.п./баллон",
                    "л/м.п./банка",
                    "л/м.п./бочка",
                    "л/м.п./бутылка",
                    "л/м.п./комплект",
                    "л/м.п./коробка",
                    "л/м.п./поддон",
                    "л/м.п./рулон",
                    "л/м.п./упаковка",
                    "л/м.п./ящик",
                    "л/м/баллон",
                    "л/м/банка",
                    "л/м/бочка",
                    "л/м/бутылка",
                    "л/м/комплект",
                    "л/м/коробка",
                    "л/м/поддон",
                    "л/м/рулон",
                    "л/м/упаковка",
                    "л/м/ящик",
                    "л/м2/баллон",
                    "л/м2/банка",
                    "л/м2/бочка",
                    "л/м2/бутылка",
                    "л/м2/комплект",
                    "л/м2/коробка",
                    "л/м2/поддон",
                    "л/м2/рулон",
                    "л/м2/упаковка",
                    "л/м2/ящик",
                    "л/м3/баллон",
                    "л/м3/банка",
                    "л/м3/бочка",
                    "л/м3/бутылка",
                    "л/м3/комплект",
                    "л/м3/коробка",
                    "л/м3/поддон",
                    "л/м3/рулон",
                    "л/м3/упаковка",
                    "л/м3/ящик",
                    "л/л/баллон",
                    "л/л/банка",
                    "л/л/бочка",
                    "л/л/бутылка",
                    "л/л/комплект",
                    "л/л/коробка",
                    "л/л/поддон",
                    "л/л/рулон",
                    "л/л/упаковка",
                    "л/л/ящик"
                });
                textBox7.Text = "Введите Описание Нормы";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Нормы";
            }
            if (StateF == 67)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox1.Text = "Введите Имя ГОСТ";
                textBox2.Text = "Введите Описание ГОСТ";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу ГОСТ";
            }
            //Добавление связи
            if (StateF == 77)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                textBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                textBox5.TabIndex = 5;
                textBox1.Visible = true;
                textBox2.Visible = true;
                textBox3.Visible = true;
                textBox4.Visible = true;
                textBox5.Visible = true;
                textBox1.Text = "Введите Код Строки Перечня БД";
                textBox2.Text = "Введите Код Изделия БД";
                textBox3.Text = "Введите Код Узла/Детали БД";
                textBox4.Text = "Введите Код Материала БД";
                textBox5.Text = "Введите Код Нормы БД";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Связи";
            }
            //Добавление Пользователя
            if (StateF == 86)
            {
                textBox1.TabIndex = 1;
                textBox2.TabIndex = 2;
                comboBox3.TabIndex = 3;
                textBox4.TabIndex = 4;
                textBox1.Visible = true;
                textBox2.Visible = true;
                comboBox3.Visible = true;
                comboBox3.Items.AddRange(new string[] { "Admin", "User"});
                textBox4.Visible= true; 
                textBox1.Text = "Введите Имя Пользователя";
                textBox2.Text = "Введите Пароль Пользователя";
                comboBox3.Text = "Выберите Тип Пользователя";
                textBox4.Text = "Введите Права Пользователя";
                TypeEvent = "Добавление данных в БД";
                DescEvent = "Пользователь " + user + " добавил данные в таблицу Пользователи";
            }
        }
        private void button1_Click(object sender, EventArgs e)//Добавить
        {
            //Закачик Заказ Перечень
            if (StateF == 29)
            {
                if (textBox1.Text != "Введите Код Заказчика" && textBox2.Text != "Введите Имя Заказчика" && comboBox3.Text != "Выберите Тип Заказчика" && textBox4.Text != "Введите Описание/Пометки Заказчика" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && comboBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && comboBox3.Text != "" && textBox4.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = comboBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a = "INSERT INTO S_Cust (ID_Cust, Name_Cust, Type_Cust, Desc_Cust) VALUES (@ID_Cust, @Name_Cust, @Type_Cust, @Desc_Cust)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "" || textBox1.Text == "Введите Код Заказчика")
                    {
                        MessageBox.Show("Введите Код Заказчика!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "" || textBox2.Text == "Введите Имя Заказчика")
                    {
                        MessageBox.Show("Введите Имя Заказчика!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox3.Text == "" || comboBox4.Text == "Выберите Тип Заказчкика")
                    {
                        MessageBox.Show("Выберите Тип Заказчкика!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Описание/Пометки Заказчика")
                    {
                        MessageBox.Show("Введите Описание/Пометки Заказчика при необходимости", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        textBox4.Text = "";
                        textBox4.ForeColor = Color.Black;
                        return;
                    }
                }
            }
            if (StateF == 30)
            {
                if (textBox1.Text != "Введите Код Заказчика БД для связи" && textBox2.Text != "Введите Код Заказа" && textBox3.Text != "Введите Имя Заказа" && comboBox5.Text != "Выберите Тип Заказа" && textBox6.Text != "Введите Описание/Пометки Заказа" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && comboBox5.ForeColor != Color.Gray && textBox6.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "" && comboBox5.Text != "" && textBox6.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = textBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a5 = comboBox5.Text.ToString();
                    a6 = textBox6.Text.ToString();
                    a = "INSERT INTO S_Order (ID_CustDB, ID_Order, Name_Order, Date_Order, Type_Order, Desc_Order) VALUES (@ID_CustDB, @ID_Order, @Name_Order, @Date_Order, @Type_Order, @Desc_Order)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "" || textBox1.Text == "Введите Код Заказчика БД для связи")
                    {
                        MessageBox.Show("Введите Код Заказчика БД для связи с Заказом!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "" || textBox2.Text == "Введите Код Заказа")
                    {
                        MessageBox.Show("Введите Код Заказа!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "" || textBox3.Text == "Введите Имя Заказа")
                    {
                        MessageBox.Show("Введите Имя Заказа!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox5.Text == "" || comboBox5.Text == "Выберите Тип Заказа")
                    {
                        MessageBox.Show("Выберите Тип Заказа!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox6.Text == "Введите Описание/Пометки Заказа")
                    {
                        MessageBox.Show("Введите Описание/Пометки Заказа!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        textBox6.Text = "";
                        textBox6.ForeColor = Color.Black;
                        return;
                    }
                }
            }
            if (StateF == 31)
            {
                if (textBox1.Text != "Введите Код Заказа БД для Связи" && textBox2.Text != "Введите Имя Строки Перечня" && textBox3.Text != "Введите Кол-во штук" && textBox4.Text != "Введите Описание/Пометки Строки Перечня" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = textBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a = "INSERT INTO S_Items (ID_OrderDB, Name_Item, Count_Item, Desc_Item) VALUES (@ID_OrderDB, @Name_Item, @Count_Item, @Desc_Item)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "" || textBox1.Text == "Введите Код Заказа БД для Связи")
                    {
                        MessageBox.Show("Введите Код Заказа БД для Связи с Заказом!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "" || textBox3.Text == "Введите Имя Строки Перечня")
                    {
                        MessageBox.Show("Введите Имя Строки Перечня!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "" || textBox4.Text == "Введите Кол-во штук")
                    {
                        MessageBox.Show("Введите Кол-во штук!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Описание/Пометки Строки Перечня")
                    {
                        MessageBox.Show("Введите Описание/Пометки Строки Перечня при необходимости!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        textBox4.Text = "";
                        textBox4.ForeColor = Color.Black;
                        return;
                    }
                }
            }
            //Изделие Узел Деталь
            if (StateF == 46)
            {
                if (textBox1.Text != "Введите Код Изделия" && textBox2.Text != "Введите Имя Изделия" && comboBox3.Text != "Выберите Тип Изделия" && textBox4.Text != "Введите ГОСТ Изделия" && textBox5.Text != "Введите Массу кг.(123,321)" && textBox6.Text != "Введите Длинну мм.(123,321)" && textBox7.Text != "Введите Ширину мм.(123,321)" && textBox8.Text != "Введите Высоту мм.(123,321)" && textBox9.Text != "Введите Описание/Пометки Изделия" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && comboBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox5.ForeColor != Color.Gray && textBox6.ForeColor != Color.Gray && textBox7.ForeColor != Color.Gray && textBox8.ForeColor != Color.Gray && textBox9.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && comboBox3.Text != "" && textBox4.Text != "" && textBox5.Text != "" && textBox6.Text != "" && textBox7.Text != "" && textBox8.Text != "" && textBox9.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = comboBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    f1 = (float) Convert.ToDouble(textBox5.Text);
                    f2 = (float) Convert.ToDouble(textBox6.Text);
                    f3 = (float) Convert.ToDouble(textBox7.Text);
                    f4 = (float) Convert.ToDouble(textBox8.Text);
                    a5 = textBox9.Text.ToString();
                    a = "INSERT INTO S_Spec0 (ID_Spec0, Name_Spec0, Type_Spec0, GOST_Spec0, Mass_Spec0, L_Spec0, W_Spec0, H_Spec0, Desc_Spec0) VALUES (@ID_Spec0, @Name_Spec0, @Type_Spec0, @GOST_Spec0, @Mass_Spec0, @L_Spec0, @W_Spec0, @H_Spec0, @Desc_Spec0)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Код Изделия" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Код Изделия!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите Имя Изделия" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите Имя Изделия!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox3.Text == "Выберите Тип Изделия" || comboBox3.Text == "")
                    {
                        MessageBox.Show("Выберите Тип Изделия!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите ГОСТ Изделия" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите ГОСТ Изделия!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox5.Text == "Введите Массу кг.(123,321)" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Массу Изделия в кг!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox6.Text == "Введите Длинну мм.(123,321)" || textBox5.Text == "")
                    {
                        MessageBox.Show("Введите Длинну Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox7.Text == "Введите Ширину мм.(123,321)" || textBox6.Text == "")
                    {
                        MessageBox.Show("Введите Ширину Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox8.Text == "Введите Высоту мм.(123,321)" || textBox7.Text == "")
                    {
                        MessageBox.Show("Введите Высоту Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox9.Text == "Введите Описание/Пометки Изделия")
                    {
                        MessageBox.Show("Введите Описание/Пометки Изделия!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        textBox9.Text = "";
                        textBox9.ForeColor = Color.Black;
                        return;
                    }
                }
            }
            if (StateF == 47)
            {
                if (textBox1.Text != "Введите Код Узла/Детали" && textBox2.Text != "Введите № Вложенности Узла/Детали (1.2.3.4.5.6)" && textBox3.Text != "Введите Порядковый № Узла/Детали (24)" && textBox4.Text != "Введите Имя Узла/Детали" && comboBox5.Text != "Выберите Тип Узла/Детали" && textBox6.Text != "Введите ГОСТ Узла/Детали" && comboBox7.Text != "" && textBox8.Text != "Введите Количество шт. (3)" && textBox9.Text != "Введите Массу кг.(123,321)" && textBox10.Text != "Введите Длинну мм.(123,321)" && textBox11.Text != "Введите Ширину мм.(123,321)" && textBox12.Text != "Введите Высоту мм.(123,321)" && textBox13.Text != "Введите Описание/Пометки Узла/Детали" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && comboBox5.ForeColor != Color.Gray && textBox6.ForeColor != Color.Gray && comboBox7.ForeColor != Color.Gray && textBox8.ForeColor != Color.Gray && textBox9.ForeColor != Color.Gray && textBox10.ForeColor != Color.Gray && textBox11.ForeColor != Color.Gray && textBox12.ForeColor != Color.Gray && textBox13.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "" && comboBox5.Text != "" && textBox6.Text != "" && comboBox7.Text != "" && textBox8.Text != "" && textBox9.Text != "" && textBox10.Text != "" && textBox11.Text != "" && textBox12.Text != "" && textBox13.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    i1 = Convert.ToInt32(textBox3.Text);
                    a3 = textBox4.Text.ToString();
                    a4 = comboBox5.Text.ToString();
                    a5 = textBox6.Text.ToString();
                    a6 = comboBox7.Text.ToString();
                    i2 = Convert.ToInt32(textBox8.Text);
                    f1 = (float)Convert.ToDouble(textBox9.Text);
                    f2 = (float)Convert.ToDouble(textBox10.Text);
                    f3 = (float)Convert.ToDouble(textBox11.Text);
                    f4 = (float)Convert.ToDouble(textBox12.Text);
                    a7 = textBox13.Text.ToString();
                    a = "INSERT INTO S_Spec1 (ID_Spec1, PNV_Spec1, PN_Spec1, Name_Spec1, Type_Spec1, GOST_Spec1, Action_Spec1, Num_Spec1, Mass_Spec1, L_Spec1, W_Spec1, H_Spec1, Desc_Spec1) VALUES (@ID_Spec1, @PNV_Spec1, @PN_Spec1, @Name_Spec1, @Type_Spec1, @GOST_Spec1, @Action_Spec1, @Num_Spec1, @Mass_Spec1, @L_Spec1, @W_Spec1, @H_Spec1, @Desc_Spec1)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Код Узла/Детали" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Код Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите № Вложенности Узла/Детали (1.2.3.4.5.6)" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите № Вложенности Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "Ведите Порядковый № Узла/Детали (24)" || textBox3.Text == "")
                    {
                        MessageBox.Show("Введите Порядковый № Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Имя Узла/Детали" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Имя Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox5.Text == "Выберите Тип Узла/Детали" || comboBox5.Text == "")
                    {
                        MessageBox.Show("Выберите Тип Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox6.Text == "Введите ГОСТ Узла/Детали" || textBox6.Text == "")
                    {
                        MessageBox.Show("Введите Количество шт!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox7.Text == "Выберите Тип действия над Узлом/Деталью" || comboBox7.Text == "")
                    {
                        MessageBox.Show("Выберите Тип действия над Узлом/Деталью!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox8.Text == "Введите Количество шт. (3)" || textBox8.Text == "")
                    {
                        MessageBox.Show("Введите Количество шт!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox9.Text == "Введите Массу кг.(123,321)" || textBox9.Text == "")
                    {
                        MessageBox.Show("Введите Массу Изделия в кг!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox10.Text == "Введите Длинну мм.(123,321)" || textBox10.Text == "")
                    {
                        MessageBox.Show("Введите Длинну Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox11.Text == "Введите Ширину мм.(123,321)" || textBox11.Text == "")
                    {
                        MessageBox.Show("Введите Ширину Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox12.Text == "Введите Высоту мм.(123,321)" || textBox12.Text == "")
                    {
                        MessageBox.Show("Введите Высоту Изделия в мм!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox13.Text == "Введите Описание/Пометки Узла/Детали")
                    {
                        MessageBox.Show("Введите Описание/Пометки Узла/Детали!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        textBox12.Text = "";
                        textBox12.ForeColor = Color.Black;
                        return;
                    }
                }
            }
            //Добавление Материалов Норм ГОСТ+
            if (StateF == 65)
            {
                if (textBox1.Text != "Введите Код Материала" && textBox2.Text != "Введите Имя Материала" && textBox3.Text != "Введите ГОСТ Материала" && textBox4.Text != "Введите Марку Материала" && comboBox5.Text != "Выберите Тип Материала" && textBox6.Text != "Введите Описание Материала" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && comboBox5.ForeColor != Color.Gray && textBox6.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "" && comboBox5.Text != "" && textBox6.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = textBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a5 = comboBox5.Text.ToString();
                    a6 = textBox6.Text.ToString();
                    a = "INSERT INTO S_Mat (ID_Mat, Name_Mat, GOST_Mat, Brand_Mat, Type_Mat, Desc_Mat) VALUES (@ID_Mat, @Name_Mat, @GOST_Mat, @Brand_Mat, @Type_Mat, @Desc_Mat)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Код Материала" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Код Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите Имя Материала" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите Имя Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "Введите ГОСТ Материала" || textBox3.Text == "")
                    {
                        MessageBox.Show("Введите ГОСТ Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Марку Материала" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Марку Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox5.Text == "Выберите Тип Материала" || comboBox5.Text == "")
                    {
                        MessageBox.Show("Выберите Тип Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox6.Text == "Введите Описание Материала" || textBox6.Text == "")
                    {
                        MessageBox.Show("Введите Описание Материала!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                }
            }
            if (StateF == 66)
            {
                if (comboBox1.Text != "Выберите Тип Нормы" && textBox2.Text != "Введите ГОСТ Нормы" && textBox3.Text != "Введите Кол-во 1 (15,654)" && textBox4.Text != "Введите Кол-во 2 (15,654)" && textBox5.Text != "Введите Кол-во 3 (15,654)" && comboBox6.Text != "Выберите Единицы Измерения Нормы" && textBox7.Text != "Введите Описание Нормы" && comboBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox5.ForeColor != Color.Gray && comboBox6.ForeColor != Color.Gray && textBox7.ForeColor != Color.Gray && comboBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "" && textBox5.Text != "" && comboBox6.Text != "" && textBox7.Text != "")
                {
                    a1 = comboBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    f1 = (float)Convert.ToDouble(textBox3.Text);
                    f2 = (float)Convert.ToDouble(textBox4.Text);
                    f3 = (float)Convert.ToDouble(textBox5.Text);
                    a3 = comboBox6.Text.ToString();
                    a4 = textBox7.Text.ToString();
                    a = "INSERT INTO S_NormM (Type_NormM, GOST_Norm, Num_M1, Num_M2, Num_P, Unit_M1M2P, Desc_NormM) VALUES (@Type_NormM, @GOST_Norm, @Num_M1, @Num_M2, @Num_P, @Unit_M1M2P, @Desc_NormM)";
                    this.Close();
                }
                else
                {
                    if (comboBox1.Text == "Выберите Тип Нормы" || comboBox1.Text == "")
                    {
                        MessageBox.Show("Выберите Тип Нормы!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите ГОСТ Нормы" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите ГОСТ Нормы!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "Введите Кол-во 1 (15,654)" || textBox3.Text == "")
                    {
                        MessageBox.Show("Введите Кол-во 1!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Кол-во 2 (15,654)" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Кол-во 2!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox5.Text == "Введите Кол-во 3 (15,654)" || textBox5.Text == "")
                    {
                        MessageBox.Show("Введите Кол-во 3!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox6.Text == "Выберите Единицы Измерения Нормы" || comboBox6.Text == "")
                    {
                        MessageBox.Show("Выберите Единицы Измерения Нормы!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox7.Text == "Введите Описание Нормы" || textBox7.Text == "")
                    {
                        MessageBox.Show("Введите Описание Нормы!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                }
            }
            if (StateF == 67)
            {
                if (textBox1.Text != "Введите Имя ГОСТ" && textBox2.Text != "Введите Описание ГОСТ" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a = "INSERT INTO S_GOST (Name_GOST, Desc_GOST) VALUES (@Name_GOST, @Desc_GOST)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Имя ГОСТ" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Имя ГОСТ!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите Описание ГОСТ" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите Описание ГОСТ!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                }
            }
            //Добавление связи
            if (StateF == 77)
            {
                if (textBox1.Text != "Введите Код Строки Перечня БД" && textBox2.Text != "Введите Код Изделия БД" && textBox3.Text != "Введите Код Узла/Детали БД" && textBox4.Text != "Введите Код Материала БД" && textBox5.Text != "Введите Код Нормы БД" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && textBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox5.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && textBox3.Text != "" && textBox4.Text != "" && textBox5.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = textBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a5 = textBox5.Text.ToString();
                    a = "INSERT INTO SNM1 (ID_ItemDB, ID_SpecDB0,ID_SpecDB1, ID_MatDB, ID_NormMDB) VALUES (@ID_ItemDB, @ID_SpecDB0, @ID_SpecDB1, @ID_MatDB, @ID_NormMDB)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Код Строки Перечня БД" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Код Строки Перечня БД!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите Код Изделия БД" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите Код Изделия БД!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox3.Text == "Введите Код Узла/Детали БД" || textBox3.Text == "")
                    {
                        MessageBox.Show("Введите Код Узла/Детали БД!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Код Материала БД" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Код Материала БД!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox5.Text == "Введите Код Нормы БД" || textBox5.Text == "")
                    {
                        MessageBox.Show("Введите Код Нормы БД!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                }

            }
            //Добавление Пользователя
            if (StateF == 86)
            {
                if (textBox1.Text != "Введите Имя Пользователя" && textBox2.Text != "Введите Пароль Пользователя" && comboBox3.Text != "Выберите Тип Пользователя" && textBox4.Text != "Введите Права Пользователя" && textBox1.ForeColor != Color.Gray && textBox2.ForeColor != Color.Gray && comboBox3.ForeColor != Color.Gray && textBox4.ForeColor != Color.Gray && textBox1.Text != "" && textBox2.Text != "" && comboBox3.Text != "" && textBox4.Text != "")
                {
                    a1 = textBox1.Text.ToString();
                    a2 = textBox2.Text.ToString();
                    a3 = comboBox3.Text.ToString();
                    a4 = textBox4.Text.ToString();
                    a = "INSERT INTO Users (N_User, P_User, Type_User, Right_User) VALUES (@N_User, @P_User, @Type_User, @Right_User)";
                    this.Close();
                }
                else
                {
                    if (textBox1.Text == "Введите Имя Пользователя" || textBox1.Text == "")
                    {
                        MessageBox.Show("Введите Имя Пользователя!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox2.Text == "Введите Пароль Пользователя" || textBox2.Text == "")
                    {
                        MessageBox.Show("Введите Пароль Пользователя!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (comboBox3.Text == "Выберите Тип Пользователя" || comboBox3.Text == "")
                    {
                        MessageBox.Show("Выберите Тип Пользователя!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                    if (textBox4.Text == "Введите Права Пользователя" || textBox4.Text == "")
                    {
                        MessageBox.Show("Введите Права Пользователя!", "Предупреждение", MessageBoxButtons.OK, MessageBoxIcon.Warning);
                        return;
                    }
                }
            }
        }
        private void button3_Click(object sender, EventArgs e)//Расширенный Режим
        {
            TypeEvent = "";
            DescEvent = "";
            if (StateF == 31)
            {
                a = "INSERT INTO S_Items (ID_OrderDB, Name_Item, Count_Item, Desc_Item) VALUES (@ID_OrderDB, @Name_Item, @Count_Item, @Desc_Item)";
                Form5 f5 = new Form5(a, TypeEvent, DescEvent, user, ConS);
                f5.Show();
            }//+++++++++++++++++
            if (StateF == 47)
            {
                a = "INSERT INTO S_Spec0 (ID_Spec0, Name_Spec0, Type_Spec0, Mass_Spec0, L_Spec0, W_Spec0, H_Spec0, Desc_Spec0) VALUES (@ID_Spec0, @Name_Spec0, @Type_Spec0, @Mass_Spec0, @L_Spec0, @W_Spec0, @H_Spec0, @Desc_Spec0)";
                //Form7 f7 = new Form7();
                //f7.Show();
            }
            if (StateF == 48)
            {
                a = "INSERT INTO S_Spec1 (ID_Spec1, PNV_Spec1, PN_Spec1, Name_Spec1, Type_Spec1, Num_Spec1, Mass_Spec1, L_Spec1, W_Spec1, H_Spec1, Desc_Spec1) VALUES (@ID_Spec1, @PNV_Spec1, @PN_Spec1, @Name_Spec1, @Type_Spec1, @Num_Spec1, @Mass_Spec1, @L_Spec1, @W_Spec1, @H_Spec1, @Desc_Spec1)";
                //Form8 f8 = new Form8();
                //f8.Show();
            }
        }
        //События БОКСОВ
        #region
        private void textBox1_Enter(object sender, EventArgs e)
        {
            textBox1.ForeColor = Color.Black;
            textBox1.Text = "";
        }
        private void textBox2_Enter(object sender, EventArgs e)
        {
            textBox2.ForeColor = Color.Black;
            textBox2.Text = "";
        }
        private void textBox3_Enter(object sender, EventArgs e)
        {
            textBox3.ForeColor = Color.Black;
            textBox3.Text = "";
        }
        private void textBox4_Enter(object sender, EventArgs e)
        {
            if (StateF == 30)
            {
                textBox4.ForeColor = Color.Black;
            }
            else
            {
                textBox4.ForeColor = Color.Black;
                textBox4.Text = "";
            }
        }
        private void textBox5_Enter(object sender, EventArgs e)
        {
            textBox5.ForeColor = Color.Black;
            textBox5.Text = "";
        }
        private void textBox6_Enter(object sender, EventArgs e)
        {
            textBox6.ForeColor = Color.Black;
            textBox6.Text = "";
        }
        private void textBox7_Enter(object sender, EventArgs e)
        {
            textBox7.ForeColor = Color.Black;
            textBox7.Text = "";
        }
        private void textBox8_Enter(object sender, EventArgs e)
        {
            textBox8.ForeColor = Color.Black;
            textBox8.Text = "";
        }
        private void textBox9_Enter(object sender, EventArgs e)
        {
            textBox9.ForeColor = Color.Black;
            textBox9.Text = "";
        }
        private void textBox10_Enter(object sender, EventArgs e)
        {
            textBox10.ForeColor = Color.Black;
            textBox10.Text = "";
        }
        private void textBox11_Enter(object sender, EventArgs e)
        {
            textBox11.ForeColor = Color.Black;
            textBox11.Text = "";
        }
        private void textBox12_Enter(object sender, EventArgs e)
        {
            textBox12.ForeColor = Color.Black;
            textBox12.Text = "";
        }
        private void textBox13_Enter(object sender, EventArgs e)
        {
            textBox13.ForeColor = Color.Black;
            textBox13.Text = "";
        }
        private void textBox14_Enter(object sender, EventArgs e)
        {
            textBox14.ForeColor = Color.Black;
            textBox14.Text = "";
        }
        private void comboBox1_Enter(object sender, EventArgs e)
        {
            comboBox1.ForeColor = Color.Black;
            comboBox1.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox1.Text = "";
        }
        private void comboBox2_Enter(object sender, EventArgs e)
        {
            comboBox2.ForeColor = Color.Black;
            comboBox2.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox2.Text = "";
        }
        private void comboBox3_Enter(object sender, EventArgs e)
        {
            comboBox3.ForeColor = Color.Black;
            comboBox3.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox3.Text = "";
        }
        private void comboBox4_Enter(object sender, EventArgs e)
        {
            comboBox4.ForeColor = Color.Black;
            comboBox4.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox4.Text = "";
        }
        private void comboBox5_Enter(object sender, EventArgs e)
        {
            comboBox5.ForeColor = Color.Black;
            comboBox5.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox5.Text = "";
        }
        private void comboBox6_Enter(object sender, EventArgs e)
        {
            comboBox6.ForeColor = Color.Black;
            comboBox6.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox6.Text = "";
        }
        private void comboBox7_Enter(object sender, EventArgs e)
        {
            comboBox7.ForeColor = Color.Black;
            comboBox7.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox7.Text = "";
        }
        private void comboBox8_Enter(object sender, EventArgs e)
        {
            comboBox8.ForeColor = Color.Black;
            comboBox8.DropDownStyle = ComboBoxStyle.DropDownList;
            comboBox8.Text = "";
        }
        #endregion
        private void button2_Click(object sender, EventArgs e)
        {
            this.Close();
        }
    }
}
